#словарь-это структура для данных в виде ключ\значение
# book={"book1":"b and m","k2":"значение"}
# print(book)
# print(book["book1"])

# names={"Данил":37529,"Алексей":37544,"Павел":81272}
# print(names)
# print(names["Павел"])

# book={"": ,"": }
# book["книга3"]="a"

# car={"компания":"skoda","модель":"kodiaq","год":"2016"}
# print(car)
# car["цвет"]="коричневый"

# a=int(input("Введите оценку от 1 до 5"))
# ocenki={1:"ужас",2:"плохо",3:"не очень",4:"неплохо",5:"отлично"}
# print(ocenki[a])
# del ocenki[5]
# print(ocenki)

# chel={"Имя":"Павел","Фамилия":"Грабинский","Возраст":16,"Профессия":"не работает"}
#del chel["Профессия"]
#chel["Хобби"]="Волейбол"
# print(chel)

# chel1={"Имя":"Павел","Фамилия":"Фамилия"}
# chel2={"Имя":"Данил","Фамилия":"Фамилия"}
# chel1.update(chel2)
# print(chel1)

# chel={"Имя":"Толя","Фамилия":"Эм","Возраст":45}
# keys=chel.keys()
# print(keys)
# keys2=list(chel.keys())
# if "Имя" in keys2:
#     print("есть")
# else:
#     print("нету")

# chel = {"Имя": "Павел", "Фамилия": "Грабинский", "Возраст": 16, "Профессия": "не работает"}
# chel1=list(chel.keys())
# if "Профессия" in chel1:
#     print("есть")
# else:
#     print("нету")

# book={"Название":"A","Год":1881}
# pairs=book.items()
# print(pairs)

a={"Название":"Minecraft","Герой":"Steve"}
b={"Пароль":9384938493,"Логин":"Pavelwqt","Баланс":1200000}
b["Возраст"]=16
del b["Баланс"]
a.update(b)
print(a)