#Функции вывода
# print(123456789)
# print("Салам")
#правила наименования переменных: 1. используем только латинские буквы, 2. нельзя использовать
#в начале, 3. нельзя использовать спец. символы кроме _ -, 4. использовать наименование
#по смыслу
#создаем переменную и вносим туда имя
# name="pavelwqt"
# print(name)
# age=15
# print(age)
# print("hi")
# print("my nickname is", name)
# print("i'm",age,"years old")
#функция ввода данных
# input("Введите данные")
# name= input("Введите имя:")
# height= input("Введите ваш рост")
# print("Ваше имя", name)
# print("Ваш рост",  height)
# login= input("Введите логин")
# print("Ваш логин", login)
# password= input("Введите пароль")
# print("Ваш пароль", password)