name = input("Введите ваше имя:")
print("Здраствуйте", name)
a = int(input("Введите ваш рост"))
b = int(input("Введите ваш возраст"))
print(a>=150 and b>=10)







# Есть аквапарк с горкой, на которую пускают, если:
# - возраст больше 10 лет
# - или рост больше 150 см
# Нужно написать программу, которая:
# - приветствует посетителя по имени
# - запрашивает возраст и рост
# - проверяет возраст и рост на допустимые значения
# - выдает решение в виде допуска на горку в виде: True или False